Основные_объекты_финиш/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКурса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Основные_объекты_финиш/src/Catalogs/Валюты/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПолучитьКурс(Команда)
	
	//Занятие 6--
	АктуальныеДанныеПоВалюте = ОбщийМодульНаСервереМожноВызватьСКлиента.ПолучитьАктуальныеДанныеПоВалюте( 
	Элементы.Список.ТекущаяСтрока, ТекущаяДата());
	
	Курс = АктуальныеДанныеПоВалюте.Курс;
	Кратность = АктуальныеДанныеПоВалюте.Кратность;
	
	
	
	//Занятие 5 --
	СтруктураСДаннымиТекущейСтроки = Элементы.Список.ТекущиеДанные;
	
	//Курс = 60;
	//Кратность = 1;
	
	БуквенныйКод = СтруктураСДаннымиТекущейСтроки.БуквенныйКод;
	
	Текст = "Курс валюты " + БуквенныйКод + " на сегодня составляет "
	+ Курс + " руб. за " + Кратность + " ед.";
	
	ПоказатьПредупреждение(
	Новый ОписаниеОповещения("ПолучитьКурсЗавершение", ЭтотОбъект)
	, Текст , 10 , "Сегодня " + ТекущаяДата() );
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКурсЗавершение(ДополнительныеПараметры) Экспорт
	
	ПоказатьОповещениеПользователя("Курс показан");
	
КонецПроцедуры
